package ru.sviridovaleksey.interactionwithuser;

public class HelloMessage {

    public HelloMessage() {
        System.out.println("Добро пожаловать в хранилище файлов. Устанавливаем соединение с сервером");
    }

    public void helloMessage() {
        System.out.println("Выбирете действие:");
        System.out.println("0 - отменить действие; end - закрыть приложение");
        System.out.println("*******************************   КОМАНДЫ ДЛЯ СЕРВЕРА  *******************************");
        System.out.println("a - обновить; 1 - создать директорию; 2 - удалить директорию; 3 - создать файл; "
                + "4 - удалить файл");
        System.out.println("5 - Переименовать файл; 6 - отправить сообщение на сервер; "
                + "7 - открыть директорию; 8 - назад; 9 - отправить файл на сервер;  10 - скачать файл;");
        System.out.println();
        System.out.println("*******************************   ЛОКАЛЬНЫЕ КОМАНДЫ  *******************************");
        System.out.println("b - обновить (С:/ - по умолчанию ); 11 - открыть локальную директорию;"
                + " 13 - переименовать локальный файл  12 - удалить локальный файл или директорию;");
    }

    public void  needRegMessage() {

        System.out.println("Для входа в систему введите логин и пароль через enter");

    }


}
